app/views/entries/index.html.erb

        	<div class="col-sm-12 header"> <h3> Daily Weigh In:</h3></div>
        <%= line_chart Entry.where("user_id = #{current_user.id}").group_by_day(:date).maximum(:weighIn), ytitle: "Weight", colors:["#7b99c1"],download: true %>
---
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = $1  [["user_id", 1]]