app/controllers/entries_controller.rb

  def index
    if current_user.profile == nil
      flash[:error] = "You have a empty profile please update it"
    end
    @entries = current_user.entries.all.sort_by {|entry| entry[:entry_name]}
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = $1  [["user_id", 1]]

  def create
    @entry = Entry.new(entry_params)
    if current_user.entries << @entry
---
INSERT INTO "entries" ("date", "weighIn", "caloricGoal", "fatGoal", "carbGoal", "proteinGoal", "actualCalories", "actualFat", "actualCarb", "actualProtein", "day", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

  def update
    if @entry.update(entry_params)
---
UPDATE "entries" SET "day" = $1, "date" = $2, "updated_at" = $3 WHERE "entries"."id" = $4  [["day", "Sunday"], ["date", "12/10/17"], ["updated_at", "2017-12-11 22:33:37.112085"], ["id", 3]]