app/controllers/profiles_controller.rb

  def update
    if @profile.update(profile_params)
---
UPDATE "profiles" SET "gender" = $1, "updated_at" = $2 WHERE "profiles"."id" = $3  [["gender", "Female"], ["updated_at", "2017-12-12 19:52:45.936719"], ["id", 7]]