app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "kendomine"], ["LIMIT", 1]]
---
  def create
    # confirm that email/password combination is correct
    @user = User.find_by_username(login_params[:username])