app/controllers/users_controller.rb

  def create
    if user_params[:password] != user_params[:confirm_password]
      flash[:error] = "Password did not match"
      redirect_to signup_path
    else
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("username", "password_digest", "confirm_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"